PROCUREMENT_REQUIREMENTS = {
    "44-ФЗ": {
        "Конкурс": {
            "Полный комплект документов о закупке": [
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Порядок рассмотрения и оценки заявок на конкурс",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ],
            "Порядок оценки заявок участников закупки": [
                "Извещение",
                "Описание объекта закупки",
                "Порядок рассмотрения и оценки заявок на конкурс",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ]
        },
        "Аукцион": {
            "Полный комплект документов о закупке": [
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Запрос котировок": {
            "Полный комплект документов о закупке": [
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Закупка у единственного поставщика": {
            "Полный комплект документов о закупке": [
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Документация, подтверждающая невозможность (нецелесообразность) использования иных способов определения поставщика",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        }
    },
    "223-ФЗ": {
        "Конкурс": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Порядок рассмотрения и оценки заявок на конкурс",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ],
            "Порядок оценки заявок участников закупки": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Порядок рассмотрения и оценки заявок на конкурс",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ]
        },
        "Аукцион": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Запрос котировок": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Закупка у единственного поставщика": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Документация, подтверждающая невозможность (нецелесообразность) использования иных способов определения поставщика",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Выполнение НИР": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Поставка товара": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Оказание услуг или выполнение работ": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        }
    }
}