PROCUREMENT_REQUIREMENTS = {
    "44-ФЗ": {
        "Конкурс": {
            "Полный комплект документов о закупке": [
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Порядок рассмотрения и оценки заявок на конкурс",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ],
            "Порядок оценки заявок участников закупки": [
                "Извещение",
                "Описание объекта закупки",
                "Порядок рассмотрения и оценки заявок на конкурс",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ]
        },
        "Аукцион": {
            "Полный комплект документов о закупке": [
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Запрос котировок": {
            "Полный комплект документов о закупке": [
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Закупка у единственного поставщика": {
            "Полный комплект документов о закупке": [
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Документация, подтверждающая невозможность (нецелесообразность) использования иных способов определения поставщика",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        }
    },
    "223-ФЗ": {
        "Конкурс": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Порядок рассмотрения и оценки заявок на конкурс",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ],
            "Порядок оценки заявок участников закупки": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Порядок рассмотрения и оценки заявок на конкурс",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ]
        },
        "Аукцион": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Запрос котировок": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Закупка у единственного поставщика": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Документация, подтверждающая невозможность (нецелесообразность) использования иных способов определения поставщика",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Выполнение НИР": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Поставка товара": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        },
        "Оказание услуг или выполнение работ": {
            "Полный комплект документов о закупке": [
                "Положение о закупках организации",
                "Извещение",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Проект контракта",
                "Требования к содержанию заявки на конкурс и инструкция по ее заполнению",
                "Дополнительные материалы"
            ],
            "Описание объекта закупки": [
                "Положение о закупках организации",
                "Описание объекта закупки",
                "Проект контракта"
            ],
            "Обоснование начальной (максимальной) цены контракта": [
                "Положение о закупках организации",
                "Проект контракта",
                "Описание объекта закупки",
                "Обоснование н(м)цк",
                "Материалы, подтверждающие Обоснование н(м)цк"
            ]
        }
    }
}



DOCUMENT_TYPE_MAPPING = {
    "Объект экспертизы": "expertise_object",
    "Законодательное регулирование": "legal_regulation",
    "Способ закупки": "procurement_method",
    "Заявка на проведение экспертизы": "expertise_request",
    "Акт о приемке товара": "acceptance_act",
    "Дата контракта": "contract_date",
    "Документ о приемке и/или акт сдачи-приемки работ (услуг)": "works_acceptance_doc",
    "Документ о приемке товара (УПД, Счет-фактура и др.)": "goods_acceptance_doc",
    "Документация, подтверждающая невозможность использования иных способов определения поставщика": "impossible_alternative_doc",
    "Документы по взысканию пени и штрафов": "penalty_recovery_docs",
    "Документы, подтверждающие гарантийные обязательства": "warranty_docs",
    "Документы, подтверждающие исполнение всех условий контракта": "contract_conditions_docs",
    "Документы, подтверждающие передачу авторских прав": "ip_rights_transfer_docs",
    "Документы, подтверждающие страну происхождения товара": "goods_origin_docs",
    "Дополнительные материалы": "additional_materials",
    "Дополнительные соглашения к контракту": "contract_amendments",
    "Извещение": "notice",
    "Контракт на выполнение НИР (или НИОКР)": "nir_contract",
    "Контракт на выполнение работ (оказание услуг)": "service_contract",
    "Контракт на поставку товара": "goods_contract",
    "Материалы, подтверждающие Обоснование н(м)цк": "price_justification_docs",
    "Обоснование н(м)цк": "price_justification",
    "Описание объекта закупки": "procurement_description",
    "Отчет о выполнении НИР": "nir_report",
    "Положение о закупках организации": "procurement_policy",
    "Порядок рассмотрения и оценки заявок на конкурс": "bid_evaluation_procedure",
    "Предмет контракта": "contract_subject",
    "Проект контракта": "contract_draft",
    "Реквизиты контракта": "contract_details",
    "Сертификаты соответствия": "compliance_certificates",
    "Ссылка на ЕИС": "eis_link",
    "Техническая документация, паспорт товара и пр.": "technical_documentation",
    "Товарная накладная": "goods_invoice",
    "Требования к содержанию заявки на конкурс": "bid_requirements",
    "Фото результатов выполнения работ": "work_results_photos",
    "Фото товара": "goods_photos",
    "Экспертиза результатов исполнения контракта": "contract_execution_expertise",
}